&НаСервере
Процедура ЗаполнениеДокументаПоПериодуНачисленияНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КадроваяИсторияСотрудниковСрезПоследних.Период КАК Период,
	               |	КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	               |	КадроваяИсторияСотрудниковСрезПоследних.ГрафикРаботы КАК ГрафикРаботы,
	               |	КадроваяИсторияСотрудниковСрезПоследних.Оклад КАК Оклад,
	               |	КадроваяИсторияСотрудниковСрезПоследних.Работает КАК Работает
	               |ИЗ
	               |	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(&ПериодКонец, Работает) КАК КадроваяИсторияСотрудниковСрезПоследних
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КадроваяИсторияСотрудников.Период,
	               |	КадроваяИсторияСотрудников.Сотрудник,
	               |	КадроваяИсторияСотрудников.ГрафикРаботы,
	               |	КадроваяИсторияСотрудников.Оклад,
	               |	КадроваяИсторияСотрудников.Работает
	               |ИЗ
	               |	РегистрСведений.КадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников
	               |ГДЕ
	               |	КадроваяИсторияСотрудников.Период МЕЖДУ &ПериодНачало И &ПериодКонец
	               |	И КадроваяИсторияСотрудников.Работает = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Сотрудник,
	               |	Период";
	Запрос.УстановитьПараметр("ПериодНачало", НачалоГода(Объект.ПериодНачисления));
	Запрос.УстановитьПараметр("ПериодКонец", КонецМесяца(Объект.ПериодНачисления));
	Выборка = Запрос.Выполнить().Выбрать();
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("КонецПериода", Новый ОписаниеТипов("Дата"));
	Пока Выборка.Следующий() Цикл
		Если Выборка.Работает = Истина Тогда
			НоваяСтрока = Объект.Начисления.Добавить();
			НоваяСтрока.Сотрудник = Выборка.Сотрудник;
			НоваяСтрока.ГрафикРаботы = Выборка.ГрафикРаботы;
			НоваяСтрока.ВидРасчета = ПредопределенноеЗначение("ПланВидовРасчета.Начисления.Оклад");
			НоваяСтрока.ПоказательРасчета = Выборка.Оклад;
			Если Выборка.Период < НачалоМесяца(Объект.ПериодНачисления) Тогда
				НоваяСтрока.ДатаНачала = НачалоМесяца(Объект.ПериодНачисления);
			Иначе
				НоваяСтрока.ДатаНачала = Выборка.Период;
				Строка = Таблица.Добавить();
				Строка.КонецПериода = Выборка.Период;
			КонецЕсли;
			НоваяСтрока.ДатаОкончания = КонецМесяца(Объект.ПериодНачисления);
		КонецЕсли;
	//	Если Выборка.Работает = Ложь Тогда
	//		НоваяСтрока = Объект.Начисления.Добавить();
	//		НоваяСтрока.Сотрудник = Выборка.Сотрудник;
	//		НоваяСтрока.ГрафикРаботы = Выборка.ГрафикРаботы;
	//		НоваяСтрока.ВидРасчета = ПредопределенноеЗначение("ПланВидовРасчета.Начисления.Оклад");
	//		НоваяСтрока.ПоказательРасчета = Выборка.Оклад;
	//		Если Выборка.Период < НачалоМесяца(Объект.ПериодНачисления) Тогда
	//			НоваяСтрока.ДатаНачала = НачалоМесяца(Объект.ПериодНачисления);
	//		КонецЕсли;
	//		Если Выборка.Период > НачалоМесяца(Объект.ПериодНачисления) И Выборка.Период < КонецМесяца(Объект.ПериодНачисления) Тогда
	//			НоваяСтрока.ДатаНачала = Выборка.Период;
	//			Строка = Таблица.Добавить();
	//			Строка.КонецПериода = Выборка.Период;
	//		КонецЕсли;
	//		Если НачалоМесяца(Объект.ПериодНачисления) = Выборка.Период Тогда
	//			НоваяСтрока.ДатаНачала = НачалоМесяца(Объект.ПериодНачисления);
	//		КонецЕсли;			       
	//	КонецЕсли;
	//КонецЦикла;
	//СтрокаТЧ = Объект.Начисления;
	//Для Каждого СтрокаТЧ ИЗ Объект.Начисления Цикл
	//	Если СтрокаТЧ.ДатаОкончания = Дата(1,1,1) Тогда
	//		Если Таблица.Количество() <> 0 Тогда
	//			Для Каждого СтрокаТаблица ИЗ Таблица Цикл
	//				Если СтрокаТЧ.ДатаНачала <> СтрокаТаблица.КонецПериода И СтрокаТЧ.ДатаНачала < СтрокаТаблица.КонецПериода Тогда
	//					СтрокаТЧ.ДатаОкончания = СтрокаТаблица.КонецПериода;
	//				Иначе
	//					Продолжить;
	//				КонецЕсли;
	//				Прервать;
	//			КонецЦикла;
	//		Иначе СтрокаТЧ.ДатаОкончания = КонецМесяца(Объект.ПериодНачисления);
	//		КонецЕсли;
	//	КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеДокументаПоПериодуНачисления(Команда)
	Объект.Начисления.Очистить();
	ЗаполнениеДокументаПоПериодуНачисленияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачисленияПриИзменении(Элемент)
	Объект.ПериодНачисления = КонецМесяца(Объект.ПериодНачисления);
КонецПроцедуры 