&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Контрагенты.КонтактныйТелефон КАК КонтактныйТелефон
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Объект.Предмет.Клиент);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Объект.ОписаниеЗадачи = "Из мобильного приложения поступила заявка на регистрацию пользователя. Необходимо созвониться с клиентом " + Объект.Предмет + " по телефону: " + Выборка.КонтактныйТелефон + " и получить согласие на регистрацию, а так-же дозаполнить карточку клиента - ФИО, ДатуРождения, сведения о питомцах и другие данные, которые клиент согласится предоставить.";	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКартуМаршрута(Команда)
	ПараметрыФормы = Новый Структура("БизнесПроцесс", Объект.БизнесПроцесс);
	ОткрытьФорму("Задача.ЗадачаИсполнителя.Форма.ФормаКартаМаршрута", ПараметрыФормы);
КонецПроцедуры