&НаСервере
Процедура ОбновитьКартуМаршрута()
	Переменная = БизнесПроцесс.Ссылка.ПолучитьОбъект();     
	КартаМаршрута = Переменная.ПолучитьКартуМаршрута();  
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	ОбновитьКартуМаршрута();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка); 
	ЭтотОбъект.БизнесПроцесс = Параметры.БизнесПроцесс;
	Если ЗначениеЗаполнено(ЭтотОбъект.БизнесПроцесс) Тогда
		ОбновитьНаСервере();
	КонецЕсли;
КонецПроцедуры
