&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИзменитьНаименование();
	УстановитьВидимость();
	УстановитьВысотуКомментарий();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьНаименование()
	Если Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиент") Тогда
		Элементы.Наименование.Заголовок = "Ф.И.О. клиента"
	Иначе
		Элементы.Наименование.Заголовок = "Наименование"
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	Если Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиент") Тогда
		Элементы.ДатаРождения.Видимость = Истина;
		Элементы.ПолКлиента.Видимость = Истина;
		Элементы.Источник.Видимость = Истина;
		Элементы.ОсновнойДоговор.Видимость = Ложь;
		Элементы.Питомцы.Видимость = Истина;
	Иначе
		Элементы.ДатаРождения.Видимость = Ложь;
		Элементы.ПолКлиента.Видимость = Ложь;
		Элементы.Источник.Видимость = Ложь;
		Элементы.ОсновнойДоговор.Видимость = Истина;
		Элементы.Питомцы.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВысотуКомментарий()
	Если Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Поставщик") Тогда
		Элементы.Комментарий.Высота = 4;
	Иначе
		Элементы.Комментарий.Высота = 2;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТипКонтрагентаПриИзменении(Элемент)
	ИзменитьНаименование();
	УстановитьВидимость();
	УстановитьВысотуКомментарий();
КонецПроцедуры