Процедура ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для Каждого ФормируемаяЗадача ИЗ ФормируемыеЗадачи Цикл	
		ФормируемаяЗадача.Наименование = "Получить согласие клиента " + ЭтотОбъект.Пользователь + " на регистрацию";
		ФормируемаяЗадача.Предмет = ЭтотОбъект.Пользователь;
	КонецЦикла;
КонецПроцедуры

Процедура ПолучитьПодтверждениеРегистрацииКлиентаПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Если Задача.ПолученоСогласие Тогда
		ЭтотОбъект.РегистрацияПодтверждена = Истина;
	Иначе
		ЭтотОбъект.РегистрацияПодтверждена = Ложь;
	КонецЕсли;
КонецПроцедуры

Процедура КлиентПодтвердилРегистрациюПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
		Результат = ЭтотОбъект.РегистрацияПодтверждена;
КонецПроцедуры

Процедура ПометкаНаУдалениеПользователяОбработка(ТочкаМаршрутаБизнесПроцесса)
		Пользователь.ПолучитьОбъект().УстановитьПометкуУдаления(Истина, Истина);
КонецПроцедуры
