&НаСервере
Процедура ЗаполнениеДанныхПоПродажамЗаПериодНаСервере()
	НачалоПериода = НачалоМесяца(Объект.ПериодНачисления);
	КонецПериода = КонецМесяца(Объект.ПериодНачисления);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПродажиОбороты.Сотрудники КАК Сотрудники,
	|	ПродажиОбороты.СуммаОборот КАК Сумма
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, , ) КАК ПродажиОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудники
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	Сотрудники";
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаИтоги = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаИтоги.Следующий() Цикл
		НоваяСтрока = Объект.Начисления.Добавить();
		НоваяСтрока.Сотрудник = ВыборкаИтоги.Сотрудники;
		НоваяСтрока.ВидРасчета = ПредопределенноеЗначение("ПланВидовРасчета.Начисления.ПремияПроцентомОтПродаж");
		НоваяСтрока.ПоказательРасчета = ВыборкаИтоги.Сумма;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеДанныхПоПродажамЗаПериод(Команда)
	Объект.Начисления.Очистить();
	ЗаполнениеДанныхПоПродажамЗаПериодНаСервере();
КонецПроцедуры
