&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.АвторДокумента) Тогда
		Объект.АвторДокумента = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Номенклатура.ТекущиеДанные;
	Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
		СтрокаТЧ.Цена = РаботаСЦенами.ПолучитьЦенуЗакупкиНаДату(СтрокаТЧ.Номенклатура, Объект.Поставщик, Объект.Дата);
	Иначе
		СтрокаТЧ.Цена = 0;
	КонецЕсли;
	РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
	ПерерассчетСуммы();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ПерерассчетСуммы();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ПерерассчетСуммы();
КонецПроцедуры

&НаКлиенте
Процедура ПерерассчетСуммы()
	СтрокаТЧ = Элементы.Номенклатура.ТекущиеДанные;
	РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЦены(Команда)
	СтрокаТЧ = Элементы.Номенклатура.ТекущиеДанные;
	Для Каждого СтрокаТЧ ИЗ Объект.Товары Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
			Если РаботаСЦенами.ПолучитьЦенуЗакупкиНаДату(СтрокаТЧ.Номенклатура, Объект.Поставщик, Объект.Дата) <> 0 Тогда
				СтрокаТЧ.Цена = РаботаСЦенами.ПолучитьЦенуЗакупкиНаДату(СтрокаТЧ.Номенклатура, Объект.Поставщик, Объект.Дата);
			КонецЕсли;
		КонецЕсли;
		РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
		ПерерассчетСуммы();
	КонецЦикла;
КонецПроцедуры
