&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.АвторДокумента) Тогда
		Объект.АвторДокумента = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПеремещениеТоваровСИстекающимСрокомГодностиПриИзмененииНаСервере()
	Если ЭтотОбъект.ПеремещениеТоваровСИстекающимСрокомГодности Тогда
		Константы.ПеремещениеТоваровСИстекающимСрокомГодности.Установить(Истина);
	Иначе
		Константы.ПеремещениеТоваровСИстекающимСрокомГодности.Установить(Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПеремещениеТоваровСИстекающимСрокомГодностиПриИзменении(Элемент)
	ПеремещениеТоваровСИстекающимСрокомГодностиПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	Если Константы.ПеремещениеТоваровСИстекающимСрокомГодности.Получить() Тогда
		ЭтотОбъект.ПеремещениеТоваровСИстекающимСрокомГодности = Истина;
	Иначе
		ЭтотОбъект.ПеремещениеТоваровСИстекающимСрокомГодности = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры
